package ru.smn.mt.game.bot.dto

object PollOptions {

    val yesOptions = setOf(
        "(+) 🏀 В стартовой пятерке!",
        "(+) 🔥 Готов оформлять трипл-дабл!",
        "(+) 🗑️ Поставлю сверху!",
        "(+) 👟 Кроссовки зашнурованы",
        "(+) 🎯 Буду поливать трешками!",
        "(+) ⚡  Заряжен на победу",
        "(+) 🦖 Готов доминировать в краске",
        "(+) 🏃‍♂️ Уже бегу на перехват",
        "(+) 🔥 Иду возить этих мешков!",
        "(+) 🗑️ Оформлю им постер через голову!",
        "(+) 👟 Готов уничтожать их защиту",
        "(+) 🎯 Насую им трешек за шиворот",
        "(+) 🏀 Заберу их щит и их гордость"
    )

    val noOptions = setOf(
        "(-) 🩹 В списке травмированных",
        "(-) 🛋️ Couch-coach сегодня",
        "(-) ❌ Мимо кольца",
        "(-) 🛑 Блок-шот от работы",
        "(-) 🚪 Вне заявки на матч",
        "(-) 🛋️ Слился на диван",
        "(-) 🩹 Немощный, сижу в лазарете",
        "(-) 🤡 Я балласт, поиграйте без меня",
        "(-) 🧊 Трус не играет в баскетбол",
        "(-) 🚲 Буду катать вату дома"
    )

    val maybeOptions = setOf(
        "(+-) 🤷‍♂️ Мну сиськи, не определился",
        "(+-) ⏳ Включил режим терпилы",
        "(+-) 🔄 Ищу отмазки",
        "(+-) 🎲 Жду, пока мамуля разрешит",
        "(+-) ⚖️ Ни рыба ни мясо, хз",
        "(+-) 🐔 Врубил заднюю, но еще думаю",
        "(+-) ⏳ Придумываю сказку"
    )
}